Link: <https://contest.yandex.ru/contest/28964/enter/>

## A

Даны два списка чисел, которые могут содержать до 100000 чисел каждый. Посчитайте, сколько чисел содержится одновременно
как в первом списке, так и во втором. Примечание. Эту задачу на Питоне можно решить в одну строчку.

### Формат ввода

Вводятся два списка чисел. Все числа каждого списка находятся на отдельной строке.

<i>Example 1:</i>

| In             | Out |
|:---------------|:---:|
| 1 3 2<br>4 3 2 |  2  |

<i>Example 2:</i>

| In                        | Out |
|:--------------------------|:---:|
| 1 2 6 4 5 7<br>10 2 3 4 8 |  2  |

<i>Example 3:</i>

| In                              | Out |
|:--------------------------------|:---:|
| 1 7 3 8 10 2 5<br>6 5 2 8 4 3 7 |  5  |

```python
def main():
    first_array = set(map(int, input().split()))
    second_array = set(map(int, input().split()))
    print(len(first_array.intersection(second_array)))

    # One line solution, but not readable at all
    # print(len(set(map(int, input().split())).intersection(set(map(int, input().split())))))
```

## B

Во входной строке записана последовательность чисел через пробел. Для каждого числа выведите слово YES (в отдельной
строке), если это число ранее встречалось в последовательности или NO, если не встречалось.

### Формат ввода

Вводится список чисел. Все числа списка находятся на одной строке.

<i>Example 1:</i>

| In          |                Out                 |
|:------------|:----------------------------------:|
| 1 2 3 2 3 4 | NO<br>NO<br>NO<br>YES<br>YES<br>NO |

```python
def main():
    numbers = list(map(int, input().split()))

    unique_numbers = set()
    for number in numbers:
        if number not in unique_numbers:
            print('NO')
            unique_numbers.add(number)
        else:
            print('YES')
```

## C

Дан список. Выведите те его элементы, которые встречаются в списке только один раз. Элементы нужно выводить в том
порядке, в котором они встречаются в списке.

### Формат ввода

Вводится список чисел. Все числа списка находятся на одной строке.

<i>Example 1:</i>

| In          | Out |
|:------------|:---:|
| 1 2 2 3 3 3 |  1  |

<i>Example 2:</i>

| In              |  Out  |
|:----------------|:-----:|
| 4 3 5 2 5 1 3 5 | 4 2 1 |

```python
def main():
    numbers = list(map(int, input().split()))

    number_count = dict()

    for number in numbers:
        if number not in number_count:
            number_count[number] = 0
        number_count[number] += 1
    print(*[i[0] for i in number_count.items() if i[1] == 1])
```

## D

Август и Беатриса играют в игру. Август загадал натуральное число от 1 до n. Беатриса пытается угадать это число, для
этого она называет некоторые множества натуральных чисел. Август отвечает Беатрисе YES, если среди названных ей чисел
есть задуманное или NO в противном случае. После нескольких заданных вопросов Беатриса запуталась в том, какие вопросы
она задавала и какие ответы получила и просит вас помочь ей определить, какие числа мог задумать Август.

### Формат ввода

Первая строка входных данных содержит число n — наибольшее число, которое мог загадать Август. Далее идут строки,
содержащие вопросы Беатрисы. Каждая строка представляет собой набор чисел, разделенных пробелами. После каждой строки с
вопросом идет ответ Августа: YES или NO. Наконец, последняя строка входных данных содержит одно слово HELP.

### Формат вывода

Вы должны вывести (через пробел, в порядке возрастания) все числа, которые мог задумать Август.

<i>Example 1:</i>

| In                                                 |  Out  |
|:---------------------------------------------------|:-----:|
| 10<br>1 2 3 4 5<br>YES<br>2 4 6 8 10<br>NO<br>HELP | 1 3 5 |

<i>Example 2:</i>

| In                                                                                                                                            | Out |
|:----------------------------------------------------------------------------------------------------------------------------------------------|:---:|
| 10<br>1 2 3 4 5 6 7 8 9 10<br>YES<br>1<br>NO<br>2<br>NO<br>3<br>NO<br>4<br>NO<br>6<br>NO<br>7<br>NO<br>8<br>NO<br>9<br>NO<br>10<br>NO<br>HELP |  5  |

```python
def main():
    max_number = int(input())
    result = set(range(1, max_number + 1))
    Beatrice_input = input().strip()

    while Beatrice_input != 'HELP':
        numbers = set(map(int, Beatrice_input.split()))
        answer = input().strip()
        if answer == 'NO':
            result.difference_update(numbers)
        else:
            result.intersection_update(numbers)
        Beatrice_input = input().strip()

    print(*sorted(result))
```

## E

Неизвестный водитель совершил ДТП и скрылся с места происшествия. Полиция опрашивает свидетелей. Каждый из них говорит,
что запомнил какие-то буквы и цифры номера. Но при этом свидетели не помнят порядок этих цифр и букв. Полиция хочет
проверить несколько подозреваемых автомобилей. Будем говорить, что номер согласуется с показанием свидетеля, если все
символы, которые назвал свидетель, присутствуют в этом номере (не важно, сколько раз).

### Формат ввода

Сначала задано число M <= 100 - количество свидетелей. Далее идет M строк, каждая из которых описывает показания
очередного свидетеля. Эти строки непустые и состоят из не более чем 20 символов. Каждый символ в строке - либо цифра,
либо заглавная латинская буква, причём символы могут повторяться. Затем идёт число N <= 1000 - количество номеров.
Следующие строки представляют из себя номера подозреваемых машин и имеют такой же формат, как и показания свидетелей.

### Формат вывода

Выпишите номера автомобилей, согласующиеся с максимальным количеством свидетелей. Если таких номеров несколько, то
выведите их в том же порядке, в котором они были заданы на входе.

<i>Example 1:</i>

| In                                               |  Out   |
|:-------------------------------------------------|:------:|
| 3<br>ABC<br>A37<br>BCDA<br>2<br>A317BD<br>B137AC | B137AC |

<i>Example 2:</i>

| In                                                   |       Out        |
|:-----------------------------------------------------|:----------------:|
| 2<br>1ABC<br>3A4B<br>3<br>A143BC<br>C143AB<br>AAABC1 | A143BC<br>C143AB |

```python
def main():
    number_of_witnesses = int(input())
    witness_statements = list()
    for _ in range(number_of_witnesses):
        witness_statements.append(set(input()))

    answer = list()
    number_of_number_plates = int(input())

    max_count = 0
    for _ in range(number_of_number_plates):
        count = 0
        number_plate = input()

        for statement in witness_statements:
            if statement.issubset(number_plate):
                count += 1

        if count > max_count:
            max_count = count
            answer.clear()
            answer.append(number_plate)
        elif count == max_count:
            answer.append(number_plate)

    for number_plate in answer:
        print(number_plate)
```
