Link: <https://contest.yandex.ru/contest/27663/enter/>

## A

Дан список чисел, который может содержать до 100000 чисел. Определите, сколько в нем встречается различных чисел.

### Формат ввода

Вводится список целых чисел. Все числа списка находятся на одной строке.

### Формат вывода

Выведите ответ на задачу

<i>Example 1:</i>

| In         | Out |
|------------|-----|
| 1 2 3 2  3 | 3   |

<i>Example 2:</i>

| In                   | Out |
|----------------------|-----|
| 1 2 3 4 5 6 7 8 9 10 | 10  |

<i>Example 3:</i>

| In                    | Out |
|-----------------------|-----|
| 1 2 3 4 5 1 2 1 2 7 3 | 6   |

```python
numbers = set(map(int, input().split()))
print(len(numbers))
```

## B

Даны два списка чисел, которые могут содержать до 10000 чисел каждый. Выведите все числа, которые входят как в первый,
так и во второй список в порядке возрастания. Примечание. И даже эту задачу на Питоне можно решить в одну строчку.

### Формат ввода

Вводятся два списка целых чисел. Все числа каждого списка находятся на отдельной строке.

<i>Example 1:</i>

| In             | Out |
|----------------|-----|
| 1 3 2<br>4 3 2 | 2 3 |

<i>Example 2:</i>

| In                        | Out |
|---------------------------|-----|
| 1 2 6 4 5 7<br>10 2 3 4 8 | 2 4 |

```python
def make_set_unique(a: list):
    new_set = list()
    for element in a:
        if a not in new_set:
            new_set.append(a)
    return new_set

def main():
    first = list(map(int, input().split()))
    second = list(map(int, input().split()))
    
    first = make_set_unique(first)
    second = make_set_unique(second)
    
    f = 0
    s = 0
    while first[f] < second[s] or (f < len(first) and )


if __name__ == '__main__':
    main()
    
# easy way
print(*sorted(set(map(int, input().split())).intersection(set(map(int, input().split())))))

```

## C

### Формат ввода

### Формат вывода

<i>Example :</i>

|||
|---|---|
|||

## D

### Формат ввода

### Формат вывода

<i>Example :</i>

|||
|---|---|
|||

## E

### Формат ввода

### Формат вывода

<i>Example :</i>

|||
|---|---|
|||

## F

### Формат ввода

### Формат вывода

<i>Example :</i>

|||
|---|---|
|||

## G

### Формат ввода

### Формат вывода

<i>Example :</i>

|||
|---|---|
|||

## H

### Формат ввода

### Формат вывода

<i>Example :</i>

|||
|---|---|
|||

## I

### Формат ввода

### Формат вывода

<i>Example :</i>

|||
|---|---|
|||

## J

### Формат ввода

### Формат вывода

<i>Example :</i>

|||
|---|---|
|||