Link: <https://contest.yandex.ru/contest/28963/enter/>

## A

Август загадал натуральное число от 1 до n. Беатриса пытается угадать это число, для этого она называет некоторые
множества натуральных чисел. Август отвечает Беатрисе YES, если среди названных ей чисел есть задуманное или NO в
противном случае. После нескольких заданных вопросов Беатриса запуталась в том, какие вопросы она задавала и какие
ответы получила и просит вас помочь ей определить, какие числа мог задумать Август.

Август и Беатриса продолжают играть в игру, но Август начал жульничать. На каждый из вопросов Беатрисы он выбирает такой
вариант ответа YES или NO, чтобы множество возможных задуманных чисел оставалось как можно больше. Например, если Август
задумал число от 1 до 5, а Беатриса спросила про числа 1 и 2, то Август ответит NO, а если Беатриса спросит про 1, 2, 3,
то Август ответит YES. Если же Бетриса в своем вопросе перечисляет ровно половину из задуманных чисел, то Август из
вредности всегда отвечает NO. Наконец, Август при ответе учитывает все предыдущие вопросы Беатрисы и свои ответы на них,
то есть множество возможных задуманных чисел уменьшается.

### Формат ввода

Вам дана последовательность вопросов Беатрисы. Приведите ответы Августа на них. Первая строка входных данных содержит
число n — наибольшее число, которое мог загадать Август. Далее идут строки, содержащие вопросы Беатрисы. Каждая строка
представляет собой набор чисел, разделенных пробелами. Последняя строка входных данных содержит одно слово HELP.

### Формат вывода

Для каждого вопроса Беатрисы выведите ответ Августа на этот вопрос. После этого выведите (через пробел, в порядке
возрастания) все числа, которые мог загадать Август после ответа на все вопросы Беатрисы.

<i>Example 1:</i>

| In                                    | Out                 |
|:--------------------------------------|:--------------------|
| 10<br>1 2 3 4 5<br>2 4 6 8 10<br>HELP | NO<br>YES<br>6 8 10 |

<i>Example 1:</i>

| In                                                      | Out                                                      |
|:--------------------------------------------------------|:---------------------------------------------------------|
| 10<br>1<br>2<br>3<br>4<br>5<br>6<br>7<br>8<br>9<br>HELP | NO<br>NO<br>NO<br>NO<br>NO<br>NO<br>NO<br>NO<br>NO<br>10 |

<i>Example 1:</i>

| In                                                         | Out                        |
|:-----------------------------------------------------------|:---------------------------|
| 16<br>1 2 3 4 5 6 7 8<br>9 10 11 12<br>13 14<br>16<br>HELP | NO<br>NO<br>NO<br>NO<br>15 |

```python

```

## B

### Формат ввода

### Формат вывода

<i>Example 1:</i>

| In  | Out |
|:----|:----|
|     |     |

```python

```

## C

### Формат ввода

### Формат вывода

<i>Example 1:</i>

| In  | Out |
|:----|:----|
|     |     |

```python

```

## D

### Формат ввода

### Формат вывода

<i>Example 1:</i>

| In  | Out |
|:----|:----|
|     |     |

```python

```

## E #TIMELIMIT

Вам дается последовательность чисел. Для каждого числа определите, является ли оно числом Фибоначчи. Напомним, что числа
Фибоначчи определяются так:

### Формат ввода

Первая строка содержит одно число N (1 <= N <= 10<sup>6</sup>) – количество запросов. Следующие N строк содержат по
одному целому числу. При этом соблюдаются следующие ограничения:

1. Размер каждого числа не превосходит 5000 цифр в десятичном представлении.
2. Размер входа не превышает 1 Мб.

### Формат вывода

Для каждого числа, данного во входном файле, выведите «Yes», если оно является числом Фибоначчи, и «No» в противном
случае.

<i>Example 1:</i>

| In                                        | Out                                               |
|:------------------------------------------|:--------------------------------------------------|
| 8<br>1<br>2<br>3<br>4<br>5<br>6<br>7<br>8 | Yes<br>Yes<br>Yes<br>No<br>Yes<br>No<br>No<br>Yes |

```python
def slow():
    fibonacci_numbers = {1, 1}
    last, penultimate = 1, 1

    number_of_questions = int(input())
    for _ in range(number_of_questions):
        number = int(input())

        if number > last:
            while last < number:
                last = penultimate + last
                penultimate = last - penultimate
                fibonacci_numbers.add(last)
        if number not in fibonacci_numbers:
            print('No')
        else:
            print('Yes')


if __name__ == '__main__':
    slow()
```